In [0]:
# Importando o pandas e o leitor de url
import pandas as pd
import io
import requests

In [0]:
# Lendo a url do arquivo csv
url = "https://raw.githubusercontent.com/dressalsl/tutorialPandas/master/dataSets/missingValues.csv"
df = pd.read_csv(url)
df.head()

    Loan_ID Gender Married  ... Loan_Amount_Term Credit_History Property_Area
0  LP001015   Male     Yes  ...            360.0            1.0         Urban
1  LP001022   Male     Yes  ...            360.0            1.0         Urban
2  LP001031   Male     Yes  ...            360.0            1.0         Urban
3  LP001035   Male     Yes  ...            360.0            NaN         Urban
4  LP001051   Male      No  ...            360.0            1.0         Urban

[5 rows x 12 columns]

In [0]:
# o método .isnull() verifica os valores nulos em todas linhas e colunas. Adicionei o método .sum() para somas todos os valores nulos por coluna
df.isnull().sum()

Loan_ID               0
Gender               11
Married               0
Dependents           10
Education             0
Self_Employed        23
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount            5
Loan_Amount_Term      6
Credit_History       29
Property_Area         0
dtype: int64

In [0]:
# Fiz uma cópia do data frame original para ele não ser alterado
df_copy1 = df.copy()

In [0]:
# O método dropna() exclui todas as linhas onde há colunas com valores faltantes
df_copy1.dropna(inplace=True)

In [0]:
# Podemos ver que não existe mais linhas com valores faltantes na cópia do data frame
df_copy1.isnull().sum()

Loan_ID              0
Gender               0
Married              0
Dependents           0
Education            0
Self_Employed        0
ApplicantIncome      0
CoapplicantIncome    0
LoanAmount           0
Loan_Amount_Term     0
Credit_History       0
Property_Area        0
dtype: int64

In [0]:
# O método fillna() preencher os valores faltantes com média das colunas.
df_copy2 = df.copy()
df_copy2.fillna(df.mean(), inplace=True)
df_copy2.head()

    Loan_ID Gender Married  ... Loan_Amount_Term Credit_History Property_Area
0  LP001015   Male     Yes  ...            360.0       1.000000         Urban
1  LP001022   Male     Yes  ...            360.0       1.000000         Urban
2  LP001031   Male     Yes  ...            360.0       1.000000         Urban
3  LP001035   Male     Yes  ...            360.0       0.825444         Urban
4  LP001051   Male      No  ...            360.0       1.000000         Urban

[5 rows x 12 columns]

In [0]:
# O método fillna() pode preencher os valores faltantes com o número 1.
df_copy3 = df.copy()
df_copy3.fillna(1, inplace=True)
df_copy3.head()

    Loan_ID Gender Married  ... Loan_Amount_Term Credit_History Property_Area
0  LP001015   Male     Yes  ...            360.0            1.0         Urban
1  LP001022   Male     Yes  ...            360.0            1.0         Urban
2  LP001031   Male     Yes  ...            360.0            1.0         Urban
3  LP001035   Male     Yes  ...            360.0            1.0         Urban
4  LP001051   Male      No  ...            360.0            1.0         Urban

[5 rows x 12 columns]